Revit 2027 API
SymbolicCurve.SetVisibility Method
Sets the visibility for the symbolic curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVisibility(
	FamilyElementVisibility visibility
)
Public Sub SetVisibility (
	visibility As FamilyElementVisibility
)
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
member SetVisibility :
        visibility : FamilyElementVisibility -> unit
Parameters
visibility FamilyElementVisibility
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when visibility is null.
ArgumentException |  Thrown when visibility is not valid for symbolic curves.
InvalidOperationException |  Thrown when regeneration failed.
Remarks
The visibility of the symbolic curve geometry can be changed for different detail levels.
See Also
Reference
SymbolicCurve Class
Autodesk.Revit.DB Namespace